# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_rc_corner -name QRCtch -T {0.0} -preRoute_res {1.0} -preRoute_cap {1.0} -preRoute_clkres {0.0} -preRoute_clkcap {0.0} -postRoute_res {1.0} -postRoute_cap {1.0} -postRoute_xcap {1.0} -postRoute_clkres {1.0} -postRoute_clkcap {1.0} -qx_tech_file {../../../../apps/prebuilt/eda/designkits/GPDK/gsclib045/lan/flow/t1u1/reference_libs/GPDK045/gsclib045_svt_v4.4/gsclib045/qrc/qx/gpdk045.tch}
create_op_cond -name OpCond1 -library_file {../../../../apps/prebuilt/eda/designkits/GPDK/gsclib045/lan/flow/t1u1/reference_libs/GPDK045/gsclib045_svt_v4.4/gsclib045/timing/fast_vdd1v0_basicCells.lib} -P {1.0} -V {1.1} -T {0.0}
create_library_set -name fast_vdd1v0_basicCells.lib -timing {../../../../apps/prebuilt/eda/designkits/GPDK/gsclib045/lan/flow/t1u1/reference_libs/GPDK045/gsclib045_svt_v4.4/gsclib045/timing/fast_vdd1v0_basicCells.lib}
create_constraint_mode -name Const1 -sdc_files {genus_invs_des/genus.default_emulate_constraint_mode.sdc}
create_delay_corner -name DelayCorner1 -library_set {fast_vdd1v0_basicCells.lib} -rc_corner {QRCtch}
create_analysis_view -name AnV1 -constraint_mode {Const1} -delay_corner {DelayCorner1}
set_analysis_view -setup {AnV1} -hold {AnV1}
